# Angle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillGrid..::..Angle Property
FillGrid Class See Also
---
Gets and sets the angle of the fill grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Angle { get; set; }
```

Visual Basic
---
```text
Public Property Angle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Angle {
	double get ();
	void set (double value);
}
```

# See Also
FillGrid Class
Autodesk.Revit.DB Namespace